# Определяем переменные
username = "Иван Иванов"  # Имя пользователя
title = "Покупка продуктов"  # Заголовок заметки
content = "Купить молоко, хлеб и яйца."  # Описание заметки
status = "Активна"  # Статус заметки
created_date = "15.12.2024"  # Дата создания заметки
issue_date = "20.12.2024"  # Дата истечения заметки

# Выводим все данные заметки
print("\nИмя пользователя:", username)
print("Заголовок заметки:", title)
print("Описание заметки:", content)
print("Статус заметки:", status)
print("Дата создания заметки:", created_date)
print("Дата истечения заметки:", issue_date)